Revit 2026 API

# CurveLoopCreateViaOffset(CurveLoop, IListDouble, XYZ) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static CurveLoop CreateViaOffset(
	CurveLoop original,
	IList<double> offsetDists,
	XYZ normal
)
```
```vb
Public Shared Function CreateViaOffset (
	original As CurveLoop,
	offsetDists As IList(Of Double),
	normal As XYZ
) As CurveLoop
```
```cpp
public:
static CurveLoop^ CreateViaOffset(
	CurveLoop^ original,
	IList<double>^ offsetDists,
	XYZ^ normal
)
```
```fsharp
static member CreateViaOffset :
        original : CurveLoop *
        offsetDists : IList<float> *
        normal : XYZ -> CurveLoop
```

#### Parameters

original CurveLoop

offsetDists IListDouble

normal XYZ

#### Return Value

CurveLoop

#### Reference

CurveLoop Class

CreateViaOffset Overload

Autodesk.Revit.DB Namespace